In [1]:
pip install pandas

Requirement already satisfied: pandas in d:\depi\giz4_ais2_s1_ml\.env\lib\site-packages (3.0.0)
Requirement already satisfied: numpy>=1.26.0 in d:\depi\giz4_ais2_s1_ml\.env\lib\site-packages (from pandas) (2.3.5)
Requirement already satisfied: python-dateutil>=2.8.2 in d:\depi\giz4_ais2_s1_ml\.env\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: tzdata in d:\depi\giz4_ais2_s1_ml\.env\lib\site-packages (from pandas) (2025.3)
Requirement already satisfied: six>=1.5 in d:\depi\giz4_ais2_s1_ml\.env\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Note: you may need to restart the kernel to use updated packages.

In [1]:
import pandas as pd

In [2]:
s = pd.Series([1,2,3,4])
s

0    1
1    2
2    3
3    4
dtype: int64

In [4]:
indexed_s = pd.Series([1,2,3,4], index = ["a", "b", "c", "d"])
indexed_s

a    1
b    2
c    3
d    4
dtype: int64

In [7]:
#by2ra eldata w bytl3ha b index 0,1,2 w akhd e data as a main table w mmkn ahaded el columns zy hena
data = [[1,"40k","abd"],
        [2,"65k","def"],
        [3,"66k","ghi"],
        [4,"44k","xyz"]
]
df = pd.DataFrame(data, columns=["id", "salary", "dept"])   #yaany eldata btaaty as a matrix
df

   id salary dept
0   1    40k  abd
1   2    65k  def
2   3    66k  ghi
3   4    44k  xyz

In [ ]:
#nfsaha mmkn tt3ml using a dictionary
data_dict = {"id":[1,2,3,4],
             "salary":["40k", "65k", "66k", "44k"],
             "dept":["abc", "def", "ghi", "xyz"] }
df_2 = pd.DataFrame(data_dict)
df_2

   id salary dept
0   1    40k  abc
1   2    65k  def
2   3    66k  ghi
3   4    44k  xyz

In [ ]:
#function display t3rdly kol el columns ely aandy
(display(df))
display(df.columns) #ttl3 3l columns btaaty

   id salary dept
0   1    40k  abd
1   2    65k  def
2   3    66k  ghi
3   4    44k  xyz

Index(['id', 'salary', 'dept'], dtype='str')

In [15]:
#akhly index 0 w 1 w 2 ykono specified
index_df2 = ["R1", "R2", "R3", "R4"]
df_2.index = index_df2
df_2

    id salary dept
R1   1    40k  abc
R2   2    65k  def
R3   3    66k  ghi
R4   4    44k  xyz

In [ ]:
#bttl3 kol feature eldata type btaato eh
df.dtypes

id        int64
salary      str
dept        str
dtype: object

In [ ]:
#get a specific column with its data type
df['id'].dtype #byakhod esm el column

dtype('int64')

In [ ]:
#law ayza aghyr data type (string > category)
df['dept'] = df['dept'].astype('category')
df['dept'].dtype

CategoricalDtype(categories=['abd', 'def', 'ghi', 'xyz'], ordered=False, categories_dtype=str)

In [ ]:
#checking enha etghyrt l category
df.dtypes

id           int64
salary         str
dept      category
dtype: object

In [19]:
def chk(df, ty):
    return df[ty].dtype

In [29]:
#to specifiy how many number of rows i want
df.head(2) #2 mn fo2

   id salary dept
0   1    40k  abd
1   2    65k  def

In [28]:
#to specifiy how many number of rows i want
df.tail(2) #2 mn taht

   id salary dept
2   3    66k  ghi
3   4    44k  xyz

In [ ]:
#btgeb description lkol haga:
#3dadhom, mean btaahom, standart dev, min/max value, Q1/Q2/Q3
df.describe()

             id
count  4.000000
mean   2.500000
std    1.290994
min    1.000000
25%    1.750000
50%    2.500000
75%    3.250000
max    4.000000

In [ ]:
#y include bs el data type elana ayzah
df.describe(include='category')

       dept
count     4
unique    4
top     abd
freq      1

In [34]:
df.columns

Index(['id', 'salary', 'dept'], dtype='str')

In [35]:
df['salary'].unique()

<StringArray>
['40k', '65k', '66k', '44k']
Length: 4, dtype: str

In [37]:
df['salary'].nunique()

4

In [38]:
df['salary'].max()

'66k'

In [39]:
df['salary'].min()

'40k'

In [ ]:
#el values ely aandna bs bttl3 as an array
df.values

array([[1, '40k', 'abd'],
       [2, '65k', 'def'],
       [3, '66k', 'ghi'],
       [4, '44k', 'xyz']], dtype=object)

In [ ]:
#btgeb kol el info
df.info()

<class 'pandas.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   id      4 non-null      int64
 1   salary  4 non-null      str
 2   dept    4 non-null      category
dtypes: category(1), int64(1), str(1)
memory usage: 404.0 bytes

In [ ]:
#akhdt row 2 fe dept
df['dept'].iloc[2]

'ghi'

In [ ]:
#row 2 column 1
df.iloc[2,1]

'66k'

In [ ]:
#slicing
#men roow 0 -> 2 "0 and 1"
df['salary'].iloc[0:2]

0    40k
1    65k
Name: salary, dtype: str

In [ ]:
#ayza kol el rows bs columns moaayna
df.iloc[:,0:2]

   id salary
0   1    40k
1   2    65k
2   3    66k
3   4    44k

In [49]:
df.drop(['salary'], axis=1)

   id dept
0   1  abd
1   2  def
2   3  ghi
3   4  xyz

In [ ]:
#law andy null value b fill it bel mean
mean = df['salary'].mean()
df['salary'] = df['salary'].fillna(value=mean)

In [50]:
data=pd.read_table('http://bit.ly/movieusers')
data

          1|24|M|technician|85711
0              2|53|F|other|94043
1             3|23|M|writer|32067
2         4|24|M|technician|43537
3              5|33|F|other|15213
4          6|42|M|executive|98101
..                            ...
937        939|26|F|student|33319
938  940|32|M|administrator|02215
939        941|20|M|student|97229
940      942|48|F|librarian|78209
941        943|22|M|student|77841

[942 rows x 1 columns]

In [53]:
#n separate el data b | w mnkhlesh awl row hwa el header
header_col = ['index', 'gender', 'dept', 'postal code']
data=pd.read_table('http://bit.ly/movieusers', sep = '|', header=None, names = header_col)
data

     index gender           dept postal code
1       24      M     technician       85711
2       53      F          other       94043
3       23      M         writer       32067
4       24      M     technician       43537
5       33      F          other       15213
..     ...    ...            ...         ...
939     26      F        student       33319
940     32      M  administrator       02215
941     20      M        student       97229
942     48      F      librarian       78209
943     22      M        student       77841

[943 rows x 4 columns]

In [55]:
user_info=pd.read_csv('http://bit.ly/uforeports')
user_info.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [ ]:
#kam row w kam col
user_info.shape

(18241, 5)

In [59]:
#to merge 2 columns > State and City = Location
user_info['Location'] = user_info.City + ', ' + user_info.State
user_info.head()

,City,Colors Reported,Shape Reported,State,Time,Location
0,Ithaca,NaN,TRIANGLE,NY,6/1/1930 22:00,"Ithaca, NY"
1,Willingboro,NaN,OTHER,NJ,6/30/1930 20:00,"Willingboro, NJ"
2,Holyoke,NaN,OVAL,CO,2/15/1931 14:00,"Holyoke, CO"
3,Abilene,NaN,DISK,KS,6/1/1931 13:00,"Abilene, KS"
4,New York Worlds Fair,NaN,LIGHT,NY,4/18/1933 19:00,"New York Worlds Fair, NY"

In [61]:
#ahawl el dataset l csv file
user_info.to_csv('test.csv')

In [ ]:
#ay space fel header of dataset law feh space bghyro l undercsore
user_info.rename(columns= {"Colors Reported" : "Colors_Reported"})

,City,Colors_Reported,Shape Reported,State,Time,Location
0,Ithaca,NaN,TRIANGLE,NY,6/1/1930 22:00,"Ithaca, NY"
1,Willingboro,NaN,OTHER,NJ,6/30/1930 20:00,"Willingboro, NJ"
2,Holyoke,NaN,OVAL,CO,2/15/1931 14:00,"Holyoke, CO"
3,Abilene,NaN,DISK,KS,6/1/1931 13:00,"Abilene, KS"
4,New York Worlds Fair,NaN,LIGHT,NY,4/18/1933 19:00,"New York Worlds Fair, NY"
...,...,...,...,...,...,...
18236,Grant Park,NaN,TRIANGLE,IL,12/31/2000 23:00,"Grant Park, IL"
18237,Spirit Lake,NaN,DISK,IA,12/31/2000 23:00,"Spirit Lake, IA"
18238,Eagle River,NaN,NaN,WI,12/31/2000 23:45,"Eagle River, WI"
18239,Eagle River,RED,LIGHT,WI,12/31/2000 23:45,"Eagle River, WI"
18240,Ybor,NaN,OVAL,FL,12/31/2000 23:59,"Ybor, FL"

In [ ]:
#tare2a ashal msh manual tghyr kolo
user_info.columns = user_info.columns.str.replace(' ', '_')
user_info.head()

,City,Colors_Reported,Shape_Reported,State,Time,Location
0,Ithaca,NaN,TRIANGLE,NY,6/1/1930 22:00,"Ithaca, NY"
1,Willingboro,NaN,OTHER,NJ,6/30/1930 20:00,"Willingboro, NJ"
2,Holyoke,NaN,OVAL,CO,2/15/1931 14:00,"Holyoke, CO"
3,Abilene,NaN,DISK,KS,6/1/1931 13:00,"Abilene, KS"
4,New York Worlds Fair,NaN,LIGHT,NY,4/18/1933 19:00,"New York Worlds Fair, NY"